import React from 'react';
import ReactDOM from 'react-dom';
import App from './components/app';
import 'bootstrap/dist/css/bootstrap.css';
import './index.css';

ReactDOM.render(<App />, document.getElementById('root'));

// Домашнее задание:

// Клонировать себе репозиторий с материалами для приложения
// https://github.com/ihinstone/react-gotapp  
// Запустить команду npm i для установки всех зависимостей
// Отрефакторить приложение и привести его к одному стилю(либо css, либо styled и тд...)
// Создать сервис для получения всех данных из нашего api. (то, что в видео + дополнить недостающие функции)
// Обязательно протестировать его работоспособность, данные вывести в консоль (напоминаю, для создания запросов нужен любой локальный сервер, если без реакта)
// Разместить сервис в приложении
// Опционально: стилизовать приложение на свой вкус

// Подсмотреть ответ тут
